app/controllers/cars_controller.rb

	def create
		@car = Car.new(params[:car])
		respond_to do |format|
			if @car.save flash[:notice] = 'Car was successfully created.'
---
INSERT INTO `cars` (`model`, `created_at`, `updated_at`, `colour`, `carType`, `regNum`) VALUES('Toyota', '2012-02-21 08:28:09', '2012-02-21 08:28:09', 'silver', 'Carina', 'MJ3424')

	def update
		respond_to do |format|
			if @car.update_attributes(params[:car])
---
UPDATE `cars` SET `colour` = 'Light Green', `updated_at` = '2012-02-21 15:51:28' WHERE `id` = 3

	def destroy
		@car.destroy
---
DELETE FROM `cars` WHERE `id` = 3

	def find_car
		@car = Car.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 4)