app/controllers/drivers_controller.rb

	def create
		@driver = Driver.new(params[:driver])
		respond_to do |format|
			if @driver.save flash[:notice] = 'Driver was successfully created.'
---
INSERT INTO `drivers` (`created_at`, `employeeId`, `updated_at`, `lname`, `gender`, `fname`, `mobileNum`) VALUES('2012-02-21 17:39:24', 'BHHSJA', '2012-02-21 17:39:24', 'Phiri', 'male', 'James', '09995637309')

	def update
		respond_to do |format|
			if @driver.update_attributes(params[:driver])
---
UPDATE `drivers` SET `updated_at` = '2012-02-21 17:40:33', `employeeId` = 'B0002' WHERE `id` = 1

	def find_driver
		@driver = Driver.find(params[:id])
---
SELECT * FROM `drivers` WHERE (`drivers`.`id` = 1)