app/controllers/trip_logs_controller.rb

SELECT * FROM `drivers` WHERE (`drivers`.`id` = '--- :driver_id\n')
---
  	def index
		@triplogs = TripLog.find(:all)
		@alldrivers= Driver.find(:all)

INSERT INTO `trip_logs` (`mileageFrom`, `driver_id`, `departureTime`, `created_at`, `updated_at`, `car_id`, `mileageTo`, `locationFrom`, `locationTo`, `tripDate`, `arrivalTime`) VALUES(1200, 0, '2000-01-01 12:23:00', '2012-02-23 13:34:08', '2012-02-23 13:34:08', 0, 1400, 'Kawale', 'mchesi', '2011-12-10', '2000-01-01 14:23:00')
---
	def create
		@triplog = TripLog.new(params[:trip_log])
		respond_to do |format|
			if @triplog.save flash[:notice] = 'Trip details were successfully created.'

SELECT * FROM `trip_logs` WHERE (`trip_logs`.`id` = 1)
---
	def find_trip
		@triplog = TripLog.find(params[:id])