app/controllers/users_controller.rb

	def show
		#raise params.to_yaml
		@user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 0)

	def create
		@user = User.new(params[:user])
		respond_to do |format|
			if @user.save flash[:notice] = 'New user was successfully created.'
---
INSERT INTO `users` (`salt`, `created_at`, `updated_at`, `username`, `hashed_password`, `lname`, `fname`) VALUES(NULL, '2012-02-23 15:57:57', '2012-02-23 15:57:57', 'mbanda', NULL, 'Banda', 'Mary')